ARCHITECTURAL_COMPONENTS_DATA = [
    # 数据_小式(或无斗栱大式）建筑木构件权衡数据---
    # 柱类
    {'类别': '柱类', '构件名称': '檐柱(小檐柱)', '长': '', '宽': '', '高': '11D或8/10明间面宽', '厚(或进深)': '', '径': 'D', '备注': ''},
    {'类别': '柱类', '构件名称': '金柱(老檐柱)', '长': '', '宽': '', '高': '檐柱高+廊步五举', '厚(或进深)': '', '径': 'D+1寸', '备注': ''},
    {'类别': '柱类', '构件名称': '中柱', '长': '', '宽': '', '高': '按实计', '厚(或进深)': '', '径': 'D+2寸', '备注': ''},
    {'类别': '柱类', '构件名称': '山柱', '长': '', '宽': '', '高': '按实计', '厚(或进深)': '', '径': 'D+2寸', '备注': ''},
    {'类别': '柱类', '构件名称': '重檐金柱', '长': '', '宽': '', '高': '按实计', '厚(或进深)': '', '径': 'D+2寸', '备注': ''},
    
    # 梁类
    {'类别': '梁类', '构件名称': '抱头梁', '长': '廊步架+柱径一份', '宽': '', '高': '1.4D', '厚(或进深)': '1.1D或D+1寸', '径': '', '备注': ''},
    {'类别': '梁类', '构件名称': '五架梁', '长': '四步架+2D', '宽': '', '高': '1.5D', '厚(或进深)': '1.2D或金柱径+1寸', '径': '', '备注': ''},
    {'类别': '梁类', '构件名称': '三架梁', '长': '二步架+2D', '宽': '', '高': '1.25D', '厚(或进深)': '0.95D或4/5五架梁厚', '径': '', '备注': ''},
    {'类别': '梁类', '构件名称': '遏角梁', '长': '正身梁+斜', '宽': '', '高': '1.5D', '厚(或进深)': '1.2D', '径': '', '备注': ''},
    {'类别': '梁类', '构件名称': '随梁', '长': '', '宽': '', '高': 'D', '厚(或进深)': '0.8D', '径': '', '备注': ''},
    {'类别': '梁类', '构件名称': '双步梁', '长': '二步架+D', '宽': '', '高': '1.5D', '厚(或进深)': '1.2D', '径': '', '备注': ''},
    {'类别': '梁类', '构件名称': '单步梁', '长': '二步架+D', '宽': '', '高': '1.25D', '厚(或进深)': '4/5双步梁厚', '径': '', '备注': ''},
    {'类别': '梁类', '构件名称': '六架梁', '长': '', '宽': '', '高': '1.5D', '厚(或进深)': '1.2D', '径': '', '备注': ''},
    {'类别': '梁类', '构件名称': '四架梁', '长': '', '宽': '', '高': '5/6六架梁高或1.4D', '厚(或进深)': '4/6六架梁厚或1.1D', '径': '', '备注': ''},
    {'类别': '梁类', '构件名称': '月梁(顶梁)', '长': '顶步架+2D', '宽': '', '高': '5/6四架梁高', '厚(或进深)': '4/5四架梁厚', '径': '', '备注': ''},
    {'类别': '梁类', '构件名称': '长趴梁', '长': '', '宽': '', '高': '1.5D', '厚(或进深)': '1.2D', '径': '', '备注': ''},
    {'类别': '梁类', '构件名称': '短趴梁', '长': '', '宽': '', '高': '1.2D', '厚(或进深)': 'D', '径': '', '备注': ''},
    {'类别': '梁类', '构件名称': '抹角梁', '长': '', '宽': '', '高': '1.2D~1.4D', '厚(或进深)': 'D~1.2D', '径': '', '备注': ''},
    {'类别': '梁类', '构件名称': '承重梁', '长': '', '宽': '', '高': 'D+2寸', '厚(或进深)': 'D', '径': '', '备注': ''},
    {'类别': '梁类', '构件名称': '踩步梁', '长': '', '宽': '', '高': '1.5D', '厚(或进深)': '1.2D', '径': '', '备注': '用于歇山'},
    {'类别': '梁类', '构件名称': '踏步金', '长': '', '宽': '', '高': '1.5D', '厚(或进深)': '1.2D', '径': '', '备注': '用于歇山'},
    {'类别': '梁类', '构件名称': '太平梁', '长': '', '宽': '', '高': '1.2D', '厚(或进深)': 'D', '径': '', '备注': ''},
   
    # 枋类
    {'类别': '枋类', '构件名称': '穿插枋', '长': '廊步架+2D', '宽': '', '高': 'D', '厚(或进深)': '0.8D', '径': '', '备注': ''},
    {'类别': '枋类', '构件名称': '檐枋', '长': '随面宽', '宽': '', '高': 'D', '厚(或进深)': '0.8D', '径': '', '备注': ''},
    {'类别': '枋类', '构件名称': '金枋', '长': '随面宽', '宽': '', '高': 'D或0.8D', '厚(或进深)': '0.8或0.65D', '径': '', '备注': ''},
    {'类别': '枋类', '构件名称': '上金枋、脊枋', '长': '随面宽', '宽': '', '高': '0.8D', '厚(或进深)': '0.65D', '径': '', '备注': ''},
    {'类别': '枋类', '构件名称': '燕尾枋', '长': '随檩出梢', '宽': '', '高': '同垫板', '厚(或进深)': '0.25D', '径': '', '备注': ''},
        # --- 表 1-1 数据 ---
    # 檩椽类
    {'类别': '檩类', '构件名称': '檐檩、金檩、脊檩', '长': '', '宽': '', '高': '', '厚(或进深)': '', '径': 'D或0.9D', '备注': ''},
    {'类别': '檩类', '构件名称': '扶脊木', '长': '', '宽': '', '高': '', '厚(或进深)': '', '径': '0.8D', '备注': ''},
    
    # 望板类
    {'类别': '垫板类', '构件名称': '檐垫板、老檐垫板', '长': '', '宽': '', '高': '0.8D', '厚(或进深)': '0.25D', '径': '', '备注': ''},
    {'类别': '垫板类', '构件名称': '金垫板、脊垫板', '长': '', '宽': '', '高': '0.65D', '厚(或进深)': '0.25D', '径': '', '备注': ''},
   
    # 柱瓜类
    {'类别': '柱瓜类', '构件名称': '柁墩', '长': '2D', '宽': '0.8上架梁厚', '高': '按实计', '厚(或进深)': '按实计', '径': '', '备注': ''},
    {'类别': '柱瓜类', '构件名称': '金瓜柱', '长': '', '宽': 'D', '高': '按实计', '厚(或进深)': '上架梁厚0.8', '径': '', '备注': ''},
    {'类别': '柱瓜类', '构件名称': '脊瓜柱', '长': '', '宽': 'D~0.8D', '高': '按举架', '厚(或进深)': '0.8三架梁厚', '径': '', '备注': ''},
    {'类别': '瓜柱类', '构件名称': '角背', '长': '一步架', '宽': '', '高': '1/2~1/3脊瓜柱高', '厚(或进深)': '1/3自身高', '径': '', '备注': ''},
    
    # 角梁类
    {'类别': '角梁类', '构件名称': '老角梁', '长': '', '宽': '', '高': 'D', '厚(或进深)': '2/3D', '径': '', '备注': ''},
    {'类别': '角梁类', '构件名称': '仔角梁', '长': '', '宽': '', '高': 'D', '厚(或进深)': '2/3D', '径': '', '备注': ''},
    {'类别': '角梁类', '构件名称': '由戗', '长': '', '宽': '', '高': 'D', '厚(或进深)': '2/3D', '径': '', '备注': ''},
    {'类别': '角梁类', '构件名称': '凹角老角梁', '长': '', '宽': '', '高': '2/3D', '厚(或进深)': '2/3D', '径': '', '备注': ''},
    {'类别': '角梁类', '构件名称': '凹角梁盖', '长': '', '宽': '', '高': '2/3D', '厚(或进深)': '2/3D', '径': '', '备注': ''},
    # 椽类
    {'类别': '椽类', '构件名称': '圆椽', '长': '', '宽': '', '高': '', '厚(或进深)': '', '径': '1/3D', '备注': ''},      
    {'类别': '椽类', '构件名称': '方椽、飞椽', '长': '', '宽': '1/3D', '高': '', '厚(或进深)': '1/3D', '径': '', '备注': ''},
    {'类别': '椽类', '构件名称': '花架椽', '长': '', '宽': '1/3D', '高': '', '厚(或进深)': '1/3D', '径': '', '备注': ''},
    {'类别': '椽类', '构件名称': '罗锅椽', '长': '', '宽': '1/3D', '高': '', '厚(或进深)': '1/3D', '径': '', '备注': ''},
    # 连檐类
    {'类别': '连檐类', '构件名称': '大连檐', '长': '', '宽': '0.4D或1.2椽径', '高': '', '厚(或进深)': '1/3D', '径': '', '备注': ''},
    {'类别': '连檐类', '构件名称': '小连檐', '长': '', '宽': '1/3D', '高': '', '厚(或进深)': '1.5望板厚', '径': '', '备注': ''},
    # 瓦口、衬头木
    {'类别': '瓦口、衬头木', '构件名称': '横望板', '长': '', '宽': '', '高': '', '厚(或进深)': '1/15D或1/5椽径', '径': '', '备注': ''},
    {'类别': '瓦口、衬头木', '构件名称': '顺望板', '长': '', '宽': '', '高': '', '厚(或进深)': '1/9D或1/3椽径', '径': '', '备注': ''},
    {'类别': '瓦口、衬头木', '构件名称': '瓦口', '长': '', '宽': '', '高': '', '厚(或进深)': '同横望板', '径': '', '备注': ''},
    {'类别': '瓦口、衬头木', '构件名称': '衬头木', '长': '', '宽': '', '高': '', '厚(或进深)': '1/3D', '径': '', '备注': ''},

    # 歇山、悬山、楼房各部
    {'类别': '歇山_悬山_楼房各部', '构件名称': '踏脚木', '长': '', '宽': '', '高': 'D', '厚(或进深)': '0.8D', '径': '', '备注': ''},
    {'类别': '歇山_悬山_楼房各部', '构件名称': '草架柱', '长': '', '宽': '0.5D', '高': '', '厚(或进深)': '0.5D', '径': '', '备注': ''},
    {'类别': '歇山_悬山_楼房各部', '构件名称': '穿', '长': '', '宽': '0.5D', '高': '', '厚(或进深)': '0.5D', '径': '', '备注': ''},
    {'类别': '歇山_悬山_楼房各部', '构件名称': '山花板', '长': '', '宽': '', '高': '', '厚(或进深)': '1/3~1/4D', '径': '', '备注': ''},
    {'类别': '歇山_悬山_楼房各部', '构件名称': '博缝板', '长': '', '宽': '2~2.3D或6~7椽径', '高': '', '厚(或进深)': '1/3~1/4D或0.8~1椽径', '径': '', '备注': ''},
    {'类别': '歇山_悬山_楼房各部', '构件名称': '挂落板', '长': '', '宽': '', '高': '', '厚(或进深)': '0.8椽径', '径': '', '备注': ''},
    {'类别': '歇山_悬山_楼房各部', '构件名称': '沿边木', '长': '', '宽': '', '高': '', '厚(或进深)': '0.5D+1寸', '径': '', '备注': ''},
    {'类别': '歇山_悬山_楼房各部', '构件名称': '楼板', '长': '', '宽': '', '高': '', '厚(或进深)': '1.5~2寸', '径': '', '备注': ''},
    {'类别': '歇山_悬山_楼房各部', '构件名称': '楞木', '长': '', '宽': '', '高': '', '厚(或进深)': '0.5D+1寸', '径': '', '备注': ''},
]